Table of Contents
 Interface IPluginHook
Namespace
IdeaStatiCa.BimApiLink.Hooks
Assembly
IdeaStatiCa.BimApiLink.dll
public interface IPluginHook
Methods
 EnterImport(CountryCode)
void EnterImport(CountryCode countryCode)
Parameters
countryCode CountryCode
 EnterImportSelection(RequestedItemsType)
void EnterImportSelection(RequestedItemsType requestedType)
Parameters
requestedType RequestedItemsType
 ExitImport(CountryCode)
void ExitImport(CountryCode countryCode)
Parameters
countryCode CountryCode
 ExitImportSelection(RequestedItemsType)
void ExitImportSelection(RequestedItemsType requestedType)
Parameters
requestedType RequestedItemsType
 Edit this page